app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 05 Jun 2012 12:33:52 UTC +00:00], ["email", ""], ["name", ""], ["updated_at", Tue, 05 Jun 2012 12:33:52 UTC +00:00]]